jasmine-karma-documentation/performance/asciiart-load-test.yml
config: # Configulartions.
  target: http://asciiart.artillery.io:8080 # Target.
  phases:
    - duration: 60 # The duration of the phase.
      # `arrivalRate` and `rampTo` — Artillery will create 5 virtual users per second.
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase # The name of the phase.
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:
          # Loop action to repeat those 3 requests 100 times.
          - get:
              # Get request to the `/dino` path.
              url: "/dino"
          - get:
              url: "/pony"
          - get:
              url: "/armadillo"
        count: 100 # The number of times.