jasmine-karma-documentation/performance/asciiart-load-test.yml
config: # Configulartions.
  target: http://asciiart.artillery.io:8080 # Target.
  phases:
    - duration: 60 # The length of the phase in seconds.
      arrivalRate: 1 # The number of virtual users starting per second.
      rampTo: 5 # Gradually ramps up the number of VUs to this value during the phase.
      name: Warm up phase # A label for the phase to make reports easier to interpret.
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  plugins:
    ensure: {} # Adds response-time thresholds to ensure performance expectations are met.
    apdex: {} # Calculates the Apdex (Application Performance Index), which measures user satisfaction based on response times.
    metrics-by-endpoint: {} # Collects performance metrics for individual endpoints, providing more detailed insights.

  apdex:
    threshold: 100 # The Apdex threshold (100ms in this case). Responses faster than this are considered "satisfying" for users.
  ensure:
    thresholds:
      - http.response_time.p99: 100 # 99% of responses should be under 100ms.
      - http.response_time.p95: 75 # 95% of responses should be under 75ms.
scenarios:
  - flow: # Defines a sequence of actions (like GET requests) each user will perform.
      - loop: # Repeats the specified actions multiple times.
          - get:
              # Specifies an HTTP `GET` request to a particular endpoint (e.g., `/dino`, `/pony`, `/armadillo`).
              url: "/dino"
          - get:
              url: "/pony"
          - get:
              url: "/armadillo"
        count: 100 # The number of times.