jasmine-karma-documentation/performance/user-visit-test.yml
config:
  target: http://localhost:4200/
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Visit JasmineKarmaDocumentation
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:
          - get:
              url: "/"
        count: 100